---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightInfo.#ctor(Autodesk.Revit.DB.ExportLineweightInfo)
source: html/2e82bdfd-470b-bac6-c613-10e72e9ef049.htm
---
# Autodesk.Revit.DB.ExportLineweightInfo.#ctor Method

Constructs a new copy of the input ExportLineweightInfo object.

## Syntax (C#)
```csharp
public ExportLineweightInfo(
	ExportLineweightInfo other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExportLineweightInfo`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null